# CanManipulateProfile Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Form..::..CanManipulateProfile Method
Form Class See Also
---
Tell if a profile can be deleted/moved/rotated.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool CanManipulateProfile(
	int profileIndex
)
```

Visual Basic
---
```text
Public Function CanManipulateProfile ( _
	profileIndex As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool CanManipulateProfile(
	int profileIndex
)
```

# ### Parameters
profileIndex
    Type: System..::..Int32Index to specify the profile.
# See Also
Form Class
Autodesk.Revit.DB Namespace